{
    "collection": {
        "version": "1.0",
        "href": "http://images-api.nasa.gov/search?q=eagle%20nebula%20james%20webb%20hubble",
        "items": [
            {
                "href": "https://images-assets.nasa.gov/image/PIA25433/collection.json",
                "data": [
                    {
                        "center": "JPL",
                        "date_created": "2022-11-11T00:00:00Z",
                        "description": "The dusty face of the Eagle Nebula and its surroundings are revealed in this image based on data from NASA's Wide Field Survey Explorer (WISE). WISE detects infrared light, or a range of wavelengths longer than what the human eye can see. This large star forming region is about 5,700 light years away from Earth and is most famous for being home to the the \"Pillars of Creation,\" a region famously imaged by NASA's Hubble and James Webb space telescopes. The WISE data reveals the entire structure of the nebula surrounding the pillars, which themselves can be seen as a faint yellow-green feature inside the white circle.  While the WISE view of the \"Pillars\" is not as sharp as those taken by Webb and Hubble, the telescope's wide field of view allows us to explore the extended nebula around it. When viewed in visible light, the dust is dark and opaque. In these infrared wavelengths, the dust becomes more translucent, and emits infrared light, shown in green, yellow, and red in this image.  The data used in this image came from WISE's primary mission which ran from 2009 to 2011. In 2013, NASA took the spacecraft out of hibernation and began using it to track and study near-Earth objects. The mission and the spacecraft were renamed NEOWISE. However, the data is still being used by astronomers to study objects and regions outside our solar system.  Blue and cyan are used to represent infrared light at wavelengths of 3.4 and 4.6 microns, while green and red display longer wavelengths of 12 and 22 microns, respectively.  Animation available at https://photojournal.jpl.nasa.gov/catalog/PIA25433",
                        "description_508": "The dusty face of the Eagle Nebula and its surroundings are revealed in this image based on data from NASA's Wide Field Survey Explorer (WISE).",
                        "keywords": [
                            "Wide-field Infrared Survey Explorer (WISE)",
                            "Eagle Nebula"
                        ],
                        "media_type": "image",
                        "nasa_id": "PIA25433",
                        "secondary_creator": "NASA/JPL-Caltech",
                        "title": "The Eagle Nebula Observed by WISE"
                    }
                ],
                "links": [
                    {
                        "href": "https://images-assets.nasa.gov/image/PIA25433/PIA25433~thumb.jpg",
                        "rel": "preview",
                        "render": "image"
                    }
                ]
            },
            {
                "href": "https://images-assets.nasa.gov/audio/Ep31_The James Webb Space Telescope/collection.json",
                "data": [
                    {
                        "center": "JSC",
                        "title": "Ep31_The James Webb Space Telescope",
                        "keywords": [
                            "james webb",
                            "space telescope",
                            "jwst",
                            "houston",
                            "podcast",
                            "jonathan homan",
                            "universe",
                            "vacuum chamber",
                            "chamber a",
                            "johnson",
                            "center"
                        ],
                        "nasa_id": "Ep31_The James Webb Space Telescope",
                        "date_created": "2018-02-09T00:00:00Z",
                        "media_type": "audio",
                        "description_508": "Full transcript in the description",
                        "description": "Production Transcript for Ep31_The James Webb Space Telescope.mp3     [00:00:00] >> Houston!  We have a podcast.  Welcome to the official podcast of the NASA Johnson Space Center, Episode 31, the James Webb Space Telescope.  I'm Gary Jordan, and I'll be your host today.  So on this podcast, we bring in the experts, NASA scientists, engineers, astronauts, bring them right here on the show to tell you everything about NASA.  So today we are talking about the James Webb Space Telescope with Jonathan Homan.  He's the Johnson Space Center Project Manager for Webb's Chamber A testing.  Chamber A is the giant vacuum chamber that we have here in Texas.  So Jonathan and I had a great discussion about what the James Webb Space Telescope is.  Some of the testing that was actually done actually wrapped up two weeks ago here in Houston, but also some of the testing in other centers, as well as what the telescope is destined to find.  So with no further delay, let's go light speed and jump right ahead to our talk with Mr. Jonathan Homan.  Enjoy.    [00:00:53] [ Music ]    [00:01:01] >> T minus five seconds and counting...  [inaudible].    [00:01:08] >> Houston!  We have a podcast.    [00:01:12] [ Music ]    [00:01:17] >> Jonathan, thanks so much for coming today on the podcast.  I know you are a very busy man right now, especially because the James Webb is kind of wrapping up its testing operations here at Johnson, is that right?    [00:01:29] >> That is correct.  No, I'm glad to be here, and yeah, we wrapped up the testing probably right before Thanksgiving.    [00:01:38] >> All right.    [00:01:38] >> And now we're in kind of what we're calling like the de-integration phase from how we had to test it to packaging it up so it can get ready for its next step of its project, getting ready for launch.    [00:01:50] >> And that's happening soon, right?    [00:01:51] >> Oh yeah.  No, it's-- we're actually putting it in its shipping container tomorrow and--    [00:01:56] >> Yeah!    [00:01:57] >> It will be leaving the Johnson Space Center late Monday night, probably Tuesday morning.    [00:02:05] >> Okay.    [00:02:05] >> And leaving Ellington on Thursday.    [00:02:07] >> Sweet!  All right!  So that's it!    [00:02:09] >> That's it!    [00:02:10] >> Go out for a drink after that, celebrate, I am done!    [00:02:13] >> Correct [laughs].    [00:02:13] >> And then head off to the next guy.  Where's it going next actually?    [00:02:17] >> So it's flying to Los Angeles, and will be at the Northup Bremen facility in Redondo Beach, south of LAX, where it gets integrated with the sun shield and the spacecraft bus, so the, you know, the sun shield has been, you know, one of the huge parts of the telescope and one of the most important parts, so it has a series of testing once its fully integrated, mostly deployments and some acoustic testing.    [00:02:46] >> All right, well fantastic.  That's why I think you're the perfect person to have here, since you've been here working with the James Webb Space Telescope for quite some time now, so you kind of have a good sense of not only the testing, but a little bit more about just what is this telescope and what is it going to do?  So I kind of want to just kind of dive into that, just the whole overview of what is the James Webb space telescope?  So let's start with that.  What is it?    [00:03:12] >> Okay so you know James Webb is kind of a general purpose science tool.  It is part of the next generation of great observatories NASA is working on, so if you think of like the Hubble, Hubble was probably the biggest known great observatory of its generation, so you think like, you know, you had Chandah, Hubble, Spitzer, and I think a few other ones that were, you know, smaller, but Hubble was the big one.    [00:03:38] >> Yeah.    [00:03:39] >> And that's kind of NASA's plan for, you know, the science mission and some of their observations and James Webb is that big, big observatory, so it is not a replacement for Hubble, but a successor.    [00:03:56] >> Okay.  So from what I know about the telescopes, and I'm definitely not a scientist or physicist or anything, so this is kind of, like Hubble can read things in the visual spectrum, and then Chandra is more kind of x-ray, and Spitzer is more infrared.    [00:04:12] >> Correct.    [00:04:12] >> Or did I mix those up?    [00:04:13] >> No, you're absolutely correct, very good yeah.    [00:04:15] >> So then Webb would be the visual spectrum then?    [00:04:18] >> No, no, Webb is infrared.    [00:04:20] >> I see, okay, infrared.    [00:04:22] >> So Hubble is known for being a little bit of ultraviolet, visible was kind of its main spectrum, but it also has a deep field, so it did some infrared type imaging, so if you think of the deep field image it took, where you look at a black spot, and all of a sudden, all these galaxies showed up over time--    [00:04:39] >> Yes, it was like if this really small spot in the sky zoomed in super far, and got--    [00:04:44] >> Yes, that's kind of where James Webb is picking up.    [00:04:46] >> Okay, I see.    [00:04:47] >> So it is definitely looking at the deeper, further, older light of the universe, so...    [00:04:53] >> Fantastic.  So what is the benefit of infrared over visual light?    [00:04:57] >> Well your infrared, because of its mission objectives, you know, it really needs to be in the infrared spectrum.  You know, those objectives are the first light of the universe, when, you know--    [00:05:08] >> Okay, pretty good objective [laughter].    [00:05:10] >> Yeah, yeah, where you have stars and galaxies first pulling things together, lighting up, you know, looking for the-- how the evolution of galaxies and star systems, the birth of stars, you think of things like the Eagle Nebula, that you know, Hubble has given us these great images of, but when you see the infrared, you can start seeing through it, and you see stars actually forming, stabilizing, or possibly even lighting up sometimes in there.  And James Webb can look right through those types of dust clouds and see, you know, what's going on with young stars, because they haven't cleared their space around them, like our star of course has.  Or you've got a clear kind of open area, and it's a little bit older system than a younger area where there's still lots of mass and gravity or mass and elements that can pull stars together that are available.    [00:06:04] >> There you go.  So it's kind of more like pulling back the curtains and saying okay what is going on, what can't we see with the visual spectrum?    [00:06:11] >> That, and also, yeah, as we note, with the universe expanding, you get the red shift, and because infrared is the red shift.  That's why it's so cold, that's why we tested it here at Johnson, at these really cold temperatures, because you need the observatory to be as cold or colder than the light you're trying to look at.  Because everything, you know, our bodies give off an infrared spectrum, so if you're trying to detect something else, you don't want the observatory itself to be warmer, and that's why it's designed the say it is, why we tested it the way it is, and of course, you know, like I said, you're looking at really old, light, old, old galaxies and stars.    [00:06:50] >> Yeah, you're looking at the history of the universe just by going farther and farther out.    [00:06:54] >> Yes.    [00:06:54] >> Fantastic.  So, kind of, I mean, I really want to get into the testing too because that's like, just the kind of testing that we're doing here is phenomenal, and you're the project manager for it, so perfect person to have here, but kind of-- I wanted to, before that, go into a little bit of the history, just, you know, where this all came up, because apparently, like you said, you have Hubble, you have Spitzer, you have Chandra, you have all these great telescopes that are looking out, but this was the next step.  So when did this start coming together, the James Webb?    [00:07:23] >> So it used to be called the Next Generation Space Telescope.    [00:07:26] >> Okay.    [00:07:27] >> And it probably started like pulling together ideas, what we could do, how, what kind of requirements we needed, probably in the 90s.    [00:07:39] >> Oh right!    [00:07:40] >> Yeah, I would say soon after possibly the first Hubble repair mission, I want to say 95, 96 was kind of the first really pulling together of here's an architecture that we think would work for the next great observatory and then I think in 2002, they actually awarded the first big contract, north of Bremen, to be the prime contractor for delivering this telescope to NASA.    [00:08:06] >> There you go, to build it.  Sweet!    [00:08:07] >> Yeah, to build it and of course, you know the telescope portion of it was actually managed a lot through-- by Goddard and NASA, and is being delivered to them.  So I mean kind of the high risk instruments and all that was kind of a collaboration of the different contractors, but also really managed tightly by NASA and with a partnership of both ESA and Canada.    [00:08:31] >> So I mean, like you said, it came shortly after Hubble, was it kind of the excitement of Hubble?  And just like, whoa, these are the images we're seeing?  We want more, right now, and that's what kind of sped up the process maybe?    [00:08:44] >> I wish I knew the actual answer [laughter], I don't know the actual answer, but I could definitely see that that is probably, you know, a good logical reasoning, and yeah, and definitely Hubble just-- I think people were blown away even when it wasn't totally in focus, with the lens that had the astigmatism that it had.    [00:09:01] >> Right.    [00:09:01] >> You know, we're-- so just started looking and going hey, you know, we could spread the light out and get some great science off things we didn't know about, and then once you had the repair mission, what a, you know, huge testimony it was to the Johnson Space Center, working with other centers to, you know, go up there and repair, and now we've got a-- probably at the time, and you know, the best telescope there is, because of its location being outside of the atmosphere, and the size that it was at the time so--    [00:09:27] >> Yes!  And the James Webb is going to kind of take that a step further, and we can kind of go into like, how this thing looks, because when you think about Hubble, it's like this school bus sized tube, right?  That is kind of orbiting outside a little bit higher than the international space station is right now, in terms of an orbit, but James Webb is going to go further out, and it looks very different.  So what's like, the make up of how James Webb looks?  This is an audio podcast, so kind of describe it?  I guess one of the first features that would be prominent are these shiny mirrors, right?    [00:10:00] >> Yeah, so if you see the entire space craft when it's fully deployed, it has the three big segments to it.    [00:10:04] >> Yes.    [00:10:05] >> One they call the spacecraft bus, which is like most satellites, it's got all the communications, the power, the cooling, everything that is requiring a lot of energy, and it is facing the sun and earth, and then of course, you have the separation of that huge sunshield.  The sunshield is like the size of a tennis court when it's fully deployed.  You know, bigger, it's got five layers of aluminized Kapton, and that separates of course the sun and earth and moon from the last part, which is the telescope element, which we call Otis right now, which stands for OTE and ISIM, OTE being Optical Telescope Element, and ISIM being Integrated Science Instrument Module, and the two of them make OTE, because at NASA just love to take acronyms and turn them into more acronyms.    [00:10:50] >> Yeah, why not [laughter].    [00:10:51] >> So that is the portion that actually has the primary mirror.  So OTE is the optics.  So the primary mirror.  That is 18 large hexagonal segments.  The secondary mirror, which is a smaller, probably still almost size of Hubble, but you know, a large-- no, not that, sorry about a two foot in diameter, another brilliant mirror that all the light is focused on, and then it goes through the center, and has a tertiary mirror.  From there, it goes back and is the-- that tertiary mirror will send it to one of the science instruments.    [00:11:27] >> Okay.    [00:11:27] >> And so you have five different science instruments, one delivered by the Canadians, the fine guidance system, two delivered by the Europeans, and then two were developed by NASA in the United States, so...    [00:11:38] >> All right, so very international kind of collaboration going on, and behind the scenes there, so it goes, tertiary right?  So mirror, mirror, mirror, and then it's sending it to all of these great instruments to measure different things.    [00:11:51] >> Yeah.  So it's a reflective mirror.  So all the lights collected on the primary, focused off a secondary and passed back through, versus like the old tube style, where it's strictly just lights coming through and passing from one to the next, and focused on a final source, you know.    [00:12:05] >> Okay.  So that first set of mirrors is like you said there, that hexagonal shape, they're just a series of gold-looking hexagons all kind of fitted together.    [00:12:13] >> Correct.    [00:12:13] >> So what was the design logic behind that?  Why the hexagons?    [00:12:17] >> It looks super cool, but-- when you need a mirror that big, it's really hard to produce a single monolith.    [00:12:24] >> Ah.    [00:12:25] >> So, even on the ground, there's like if you go to some other observatories that are more modern, that they're segmented, even, you know, ground things out like a Keck observatory in Hawaii, they have large mirrors that they've patched together, and hexagons make nice ability to kind of fit things in a nice shape, and essentially get, not necessarily a circle, but you can get the area you want covered pretty well, and make them in segments that are large, but not so big that they're difficult to manufacture.    [00:13:01] >> Okay.    [00:13:02] >> And then the other big thing is you know, Hubble is like two and a half meters in diameter, 2.4, or something.    [00:13:09] >> Okay.    [00:13:09] >> I don't know, it's larger than 2 meters.    [00:13:12] >> Yeah.    [00:13:13] >> And like James Webb is like six and a half meters in diameter.  So it's significantly bigger you know, Hubble was all polished glass.  This one is a, you know, lightweight beryllium.  They used beryllium because it's really stiff, it has a great thermal performance, so you know, you know it has to get cold, beryllium tends to be very consistent as it cools down or heats up and to go to the right shape, where you think like, an aluminum pan, heating, cooling, it might bend and warp.    [00:13:44] >> Yeah.    [00:13:45] >> Beryllium, you know, all metals kind of change shape a little bit, but beryllium is very consistent in holding its shape, so we know they're actually perfect mirrors when they're cryogenic, and they're not perfect mirrors right now at room temperature, and that was one of the things we had to do here at Johnson was to test it that way, but-- so you know, that was one of the reasons for using the beryllium, and then of course, the gold coating was put on there, because gold does a great job of reflecting infrared light.  So...    [00:14:13] >> Okay.    [00:14:14] >> Yeah, not absorbing the wavelength they're really looking for.  So.    [00:14:17] >> All right.  So that's an interesting point, the way that they're designed is to be imperfect here, so when you're testing it, they're imperfect because you know once it gets to space where you want it to do all of its work is actually going to form into the mirror that you want it to be.    [00:14:33] >> Correct.  When it gets down to below, you know, 40 Kelvin it's essentially a perfect mirror, and that was one of the technologies that was developed on that, was you know, they polished them as perfect mirrors.  They were tested at Huntsville, at the XRS CF chamber, which is where Chandah was originally tested, which wasn't big enough to test the entire telescope like we had at Johnson, but it was big enough that they could test the mirror segments.    [00:15:00] >> Okay.    [00:15:00] >> And map them, when they mapped them at cold temperatures, you could see, oh yeah, now it warped and moved, and is imperfect.  They took it back.  Purposefully polished in the imperfections.  Took them back to Huntsville, and tested them again, and showed that once they got to temperature, that imperfection they put into the mirror turned out to be a perfect mirror at the right temperature, if that makes sense.    [00:15:23] >> [Laughs] Yeah, no totally makes sense, you've got to design it for, you know, its ultimate destination and right now I'm sure you're looking at it just like, ah, I want you to be perfect, but--    [00:15:31] >> The other, sorry, going back to your first question--    [00:15:33] >> Yeah, sure.    [00:15:34] >> About the hexagonal shape, the other big part of that is also, you know, it's launching in a rocket ferring.    [00:15:39] >> Yeah.    [00:15:39] >> You know, you've got an area in 5, it's a 5 meter ferring, and you've got a primary mirror that is six and a half meters in diameter so it's bigger than the rocket it's going on, and the ferring, so you had to be able to come up with a design where you would fold those wings in, and fold the whole telescope up, so that it would fit in the rocket ferring, and then of course deploy in space, so...    [00:16:01] >> That's actually an interesting topic, is just the whole deployment secrets because it's kind of-- it's going to, like you said, fold in on itself, and then you're going to put it in this rocket and launch it, so actually before I go into the unfolding, where is it going to go?    [00:16:14] >> So after it leaves Northrup Grumman, part of the European agreement is they're providing the rocket, which is an Arian 5, it's launching out of French Guyana in South America.    [00:16:25] >> Okay.    [00:16:26] >> So that's its next last destination here on earth.    [00:16:30] >> Yeah.    [00:16:31] >> And before it starts observing the cosmos.    [00:16:34] >> Yeah [laughs], and then go out to is it-- a Lagrange Point?  Or...    [00:16:37] >> Correct.    [00:16:38] >> And which one?    [00:16:39] >> So it's an earth sun Lagrange Point 2.    [00:16:41] >> Okay.    [00:16:42] >> So that is about a million miles, about a million and a half kilometers on the backside of the earth, away from the sun.  So it will orbit the sun with the earth.  And it has about a half million mile diameter loop that it's doing.  I think about 8,000 kilometers around that gravitational point.  So it looks like, from the earth, it's doing this small circle, but from the sun, it's kind of doing a small sign wave.    [00:17:05] >> Oh, okay.    [00:17:06] >> If you see it.  And so it does require a little bit of energy, but it's not perfectly staying out at one spot.  It's kind of doing this really slow orbit around that Lagrange point.    [00:17:18] >> Okay.    [00:17:18] >> And it's a great place to be, because one, you're way out there, they're very thermally stable, because your view of the earth and the moon and the sun don't really affect its thermal performance much like you would if you're low earth orbit and once side you're on the sun, and the next time you're pretty well shaded.  Basic, you know, this thing is pretty well, the part that is looking at Earth, we know the thermal input that it's going to see, in solar and then we know the backside of that sun shield, so it's also very clean.  Much cleaner than, you know, low earth orbit in terms of micro meteoroids and objects like that.    [00:17:53] >> Ah, right.    [00:17:54] >> And it's very stable, you know, and of course the big thing too is now we're not orbiting the earth and having to protect the optics, you're just looking for as long as you want to look, and so, you know, you have to-- you're going around the sun and have to decide, okay what's my next object I'm going to look at, so--    [00:18:10] >> That's right because that sun shield is just going to be facing, you know, towards the sun the whole time, kind of blocking the light coming straight from the sun, so you've got this nice, clear view, nothing, nothing obstructing your view, and then you can kind of point it wherever you need, as long as it's not, you know, directly at the sun [laughs].    [00:18:25] >> Correct, correct, yeah.    [00:18:28] >> So, but that unfolding sequence is going to be kind of cool, right, because if you look at it, it's just like this giant mirror kind of hexagon, gold thing, and it's going to unfold into that shape, and then the pole comes out, the sunshields deploy.  That's going to be quite a sequence, right?    [00:18:46] >> Yeah, actually the sun shields are some of the early large deployments that happen.    [00:18:50] >> Sweet.    [00:18:51] >> So yeah, launches, you know, first thing it does is it deploys its solar panels, starts making sure it has got plenty of energy for the rest of the trip and for the rest of the actuations, and then you know, antennas and stuff like that deploy pretty early on as well for communication purposes, and then you know, yeah, you've got that sunshield, that's, like I said, probably the size of a basketball court, tennis court, it's massive when it's fully deployed.  All folded up into something that is, you know, probably less than, like I said, three or four meters in diameter, and you're going, you know, so you know, has to unfold, deploy all the sunshields, then because of the temperature difference, we actually have a deployable tower that separates the mirror from the spacecraft bus, and then it helps provide, again, a long length for some thermal isolation there.    [00:19:46] >> Oh!    [00:19:46] >> And then once all that is done then, you know, the secondary mirror would deploy, and the primary mirror would finish out.  And then there's a few more radiators on the actual spacecraft by the science instrument, on the telescope portion that would continue to do some deployments until it's out there.  But there's about two weeks of deployments.  I think there's 183 actuators that are going off, I mean it's a lot.    [00:20:14] >> Yeah.    [00:20:15] >> Things happening and a lot of anxiety [laughter] to go out there, it takes about 30 days to actually get from French Guyana to L2.    [00:20:24] >> Okay.    [00:20:25] >> So it's like 29--    [00:20:26] >> Thirty days to get to L2, and then--    [00:20:29] >> Yeah, about a month.    [00:20:30] >> And then you've got another how long until it's fully deployed?    [00:20:34] >> So on its way out there it is deploying.    [00:20:36] >> Oh, I see.    [00:20:36] >> So yeah, it's doing most of its major deployments on its way out there, allowing the mirrors to cool, and--    [00:20:42] >> Okay.    [00:20:43] >> And so yeah, you've got about two weeks of hoping everything goes well, and then like I said, another month to make sure it's actually getting into the right orbit, or about a month to make sure it's in the right orbit, and then from there it starts taking images, and then hopefully the scientists will tell us when they think they've seen the first light of the universe and start sending back really cool pictures.    [00:21:09] >> Yes, I'm very excited for that for sure, but I'm sure that whole trip is going to be very, very stressful [laughter].    [00:21:15] >> Yeah.    [00:21:16] >> A lot going on there.  But just the mission itself is just phenomenal, like what it's trying to do, and then the amount of work going into it, just all over the U.S. and is it being tested outside the U.S. too, or is it just being launched from outside the U.S.?    [00:21:32] >> It's just being launched from outside the U.S., so like I said, two of the science instruments were delivered by corporations under ESO, so European companies, and so they were-- you know, they had to go through their own certification program, but they were eventually all integrated into the final science package, and that went through its thermal document testing up by Goddard--    [00:21:55] >> Oh, okay.    [00:21:55] >> So yeah, they're SES chamber there, and like I said, a lot of the meter development work was done using Hubble, I mean, excuse me, the Chandah facility there, the XRCF at Huntsville.    [00:22:06] >> Okay.    [00:22:07] >> The mirrors have traveled all over the United States, you know, mirrors, technology was really, I think developed by Ball Aerospace in Boulder, Colorado.  They did testing there as well.  So, I mean the mirrors went from the company that polished them in California and San Francisco to testing at Huntsville, to be back to California to be re-polished, to testing in Huntsville, to be fully integrated with all their actuators to be tested at Huntsville, to be, you know, sent to Goddard, to be integrated as a system, then, you know, down here to Johnson, out to Northrup Grumman, and so I mean, the mirrors have traveled the United States, and you know, quite a bit, and like I said, then like I said the science instruments, some were from Germany, the Netherlands, and Ireland, were all in collaboration as part-- under ESA to deliver stuff, and then the Canadian space agency delivered a fine guidance system.  Those parts were tested up in Ottawa, at their CSA facility there, in their chamber, so--    [00:23:12] >> Wow.    [00:23:13] >> So a lot of work throughout the United States on this.    [00:23:17] >> Yes.    [00:23:17] >> KPL is managing the cryocooler that is used for the mirror instrument, and that is the longest wavelength that they're going to be looking at.    [00:23:24] >> Okay.    [00:23:25] >> And so it's the coldest, so it actually runs about 5, 6, 7 degrees Kelvin.    [00:23:30] >> Whew!  All right!    [00:23:30] >> And yeah, when we were doing our testing we were at 20 degrees, so you know it's like minus 4, 23 Fahrenheit, there, really close to absolute zero.    [00:23:38] >> Yeah!    [00:23:38] >> So yeah, looking at really long, older wavelengths.  And you know, that's stuff that has never been observed before, would be really interesting to see what shows up in that spectra, so.    [00:23:48] >> Exactly.  It's just amazing what you can find just from some of these telescopes now, I mean, they're discovering planets just by these small dips in light and you can discover, you know, planets now, there's hundreds of exoplanets that have been discovered all over the universe, so looking at the beginning of the universe and things that have not been looked at before, it's just an exciting concept.    [00:24:09] >> Yeah, you know, and speaking of that, of course, one of the science objectives of James Webb now is looking at planets.  Not necessarily looking for planets, but it would look at planets, be able to-- it's going to look within our solar system for traces of water, and carbon type structures, on the different planets, and how, you know, maybe some type of ring that maybe exists within our solar system, then be able to look for that in other solar systems, and go oh!  There's signs of, you know, life-giving properties around the solar system, and then it can also look at planets, and look at the spectra around that, and tell you maybe what an atmosphere is made of, and hopefully, like I said, maybe discover a planet that has water, nitrogen, oxygen, type of you know, things that would show signs of life, you know, carbon dioxide and things like that.    [00:24:55] >> Okay that's exciting [laughter].    [00:24:57] >> It's really exciting, yeah, yeah.  So yeah, so it's, you know, it's got that kind of the four major science objectives, you know, the first light, the evolution of galaxies, birth of stars, and the existence of possible life on exoplanets, and stuff like that.    [00:25:18] >> Wow.  Yeah!    [00:25:18] >> So science tool, really, hopefully will expand our human knowledge of what our universe is and what's around us and our solar system and galaxy and beyond, so--    [00:25:30] >> Unbelievable.  What a resume for the James Webb space telescope [laughter] to say what you're going to accomplish.  But you kind of hinted toward some of the testing already, and just all these parts coming, you know, first of all, traveling all over the U.S., but then all coming together.  You know, what's the story there?  You have all these different places, I'm sure they're manufactured in different places, right?    [00:25:52] >> Correct, so yeah, so you know, Goddard is where the program is managed out of, the project office is managed out of.    [00:26:01] >> Okay.    [00:26:02] >> You know, they're responsible for pulling it all together.  Well they, again, this telescope element, they pulled all that together, so you know, all the science instruments and the ISIM package was delivered to Goddard, they tested it.  And then all the components that make up the telescope were delivered there, and our [inaudible] facility, which is their huge clean room, they assembled James Webb.  So it's got the carbon fiber back plane, all the radiators, all the wiring was done, you know, everything was finally assembled there, and they'd all been tested at component level, but never tested at a system level.  So, they did test it at a system level, in terms of just its vibe and acoustic, to make sure it could survive, you know, launch--    [00:26:42] >> Yes.    [00:26:43] >> But they could never test a full optical path and everything like that.  So that was one of the main reasons of coming to the Johnson Space Center, as here is where you could actually simulate where it's going to be out in orbit, and now that you've tested all these other smaller components, and smaller chambers, you know, you could test a full system in a large thermal vacuum chamber, and still get to the deep space thermal conditions and vacuum conditions, and so--    [00:27:08] >> Yeah, so it got all assembled, all these different components tested, you know, use that other component levels, constructed at Goddard, and then from Goddard it was tested, and then it went to Johnson or did it kind of go around from there?  If it's-- so it's right from Goddard to Johnson.    [00:27:22] >> So yeah, so this large portion of the telescope went from Goddard to Johnson and from Johnson it's going to Northrup Grumman, so this is its last time it is with NASA when it leaves here.    [00:27:33] >> Oh really?    [00:27:34] >> Yeah, from there it goes to Northrup Grumman, who is the prime contractor, to be integrated with the rest of it, and like I said, it goes from there to the European space agency's launch facility at French Guyana, but yeah, so it's kind of a mixed feelings, I mean, you know, it has been nice having it here at two different NASA centers for the last few years, but it's--    [00:27:56] >> All right so it did, you said, acoustic testing at Goddard, right?    [00:28:00] >> Correct.    [00:28:01] >> And just to make sure the launch is going to be okay and everything kind of checked out there, right?  So--    [00:28:05] >> Yeah, the vibe and acoustic was a very big deal, you spend lots of money then shake something really hard that you treat with, you know, kid gloves [laughter] for all the rest of the time, and now you're-- you see this test where you're actually just shaking it, and parts are just going all over and then you at least do some type of verification to make sure everything looks like it has survived and ready to go, so--    [00:28:26] >> All right, and they got the thumbs up, and then it came here.    [00:28:29] >> Then it came here.    [00:28:29] >> All right, so then what the big question, you know, your area of expertise, what was the testing that went on here?  How did that, when did it come in and all that kind of stuff?    [00:28:38] >> I'm not sure how far back you want to go but [laughter]--    [00:28:41] >> Be here forever.    [00:28:42] >> Yeah, so the flight article got here in May of last year.    [00:28:46] >> Okay.    [00:28:46] >> May 2017, but we had been working with Goddard probably from 2004 in terms of hey this looks like the right chamber to do what we need to do for a thermal vacuum test, you know, but they had really different requirements from what the chamber was originally designed for, which was Apollo.    [00:29:06] >> Yeah.    [00:29:06] >> They've got contamination, vibration, and the thermal and test duration were way different than what Apollo needed, which was fast, fairly quick, redundant type of testing with human rated, you know, really protecting the crew and the capsule, and doing a thermal simulation of going to the moon and back.  And you know, here, they're like, you know, they don't care about the heat.  I mean, we did, because we did need to test the sunshield and some of those thermal paths, and we did do that in Chamber A, but for the most part, the telescope all have seen just the cold of space, and that's what we simulated for that.    [00:29:45] >> Okay, I should probably ask, what's Chamber A?    [00:29:48] >> So, yeah, Chamber A is a large thermal vacuum chamber here at the Johnson Space Center, in Building 32.  So there's two chambers in that building, A and B, you know, both were Apollo era chambers, and have continued to serve NASA over the years.  Chamber A is ten times the volumetric size of Chamber B, and it's about 65 feet in diameter, about 120 feet from top to bottom.    [00:30:15] >> Wow, it's huge!    [00:30:16] >> Yeah, it's huge!  So James Webb was in a shroud that was about 45 feet in diameter, and about 70 feet tall.  That put it in the thermal conditions it needed.  Like I said, in there, we made a lot of modifications, both from the Johnson side, and from Harris, which was formerly kind of Kodak was responsible for the optical testing, so we integrated all kinds of optical test equipment into the chamber as we were constructing some of that and testing it through the years, so that we are kind of starting about 14 really commissioning the chamber, and starting to integrate the-- in commissioning the GSC, and then doing a test series we call the pathfinder, from in 15 and 16, that really had a-- the engineering unit of James Webb, with the two primary mirrors, secondary mirror, and a way to kind of at least pick up light where the science instruments were.    [00:31:14] >> So we could do a full series of testing to test the system, and verify that we were going to be testing the telescope and not the equipment we designed to test the telescope.    [00:31:26] >> Yes!    [00:31:27] >> So yeah, it kind of was a shakedown series of tests.  We learned a lot from that too.  To really kind of reduce risk, change our plans of operations, and just improve our system reliability and stuff like that.    [00:31:41] >> Yeah!    [00:31:41] >> So it was really helpful!    [00:31:43] >> [Laughs] So you kind of put this sort of, I guess \"pretend\" James Webb inside to see, all right, let's see how this reacts and get it ready for the real James Webb, because like you said, Chamber A was not designed to test James Webb, it was designed for human missions, and they put human vehicles in there, I think the lunar module, and stuff like that, right?  They actually tested?    [00:32:07] >> In Chamber B, yeah.    [00:32:08] >> In Chamber B, they tested?  The lunar module?    [00:32:10] >> Yeah, Chamber A was the service command module so that's where you had, yeah, but Skylab was in Chamber A as well.    [00:32:15] >> Oh, okay.    [00:32:15] >> And then of course it has continued its use for just, you know, development of shuttle and space station and stuff like that, in terms of more hardware than human testing, so--    [00:32:26] >> Yeah.    [00:32:26] >> So you know, whenever you need a large thermal vacuum chamber, it's one of the very few that exists, so you know, it's a great asset for NASA to have something like that.    [00:32:36] >> So you started gearing it up for James Webb testing in 2014 you said or was it before that?    [00:32:42] >> So we had to modify the chamber quite a bit.  And the big years for that were in 2009, through about 2012.    [00:32:48] >> Oh okay.    [00:32:48] >> We actually replaced the pumping systems, especially the high vacuum systems, because all of them were, had oil type of system, or oil within them or an oil pumping system.  Everything, we couldn't have any type of oils around James Webb.  So everything went through like a real clean, newer technologies.  Our thermal systems used to only kind of get to about 100 Kelvin, and we needed to be able to get to about 15 Kelvin, and then, of course, we ended up just testing at 20 Kelvin for James Webb, but still we wanted to be able to, you know, kind of exceed that requirement or meet it, so 15 was kind of what we thought we'd need to-- so we had to put a different shroud in, and use helium as the cryogen for cooling it down instead of like the 100 Kelvin that is probably more liquid nitrogen type stuff, but with that, too, you know, the chamber had no vibration isolation, so at the top of the chamber now, we have a series of vibration isolators, everything was suspended in the chamber, so when we were testing James Webb, all its primary optical test equipment was sitting above it that was mapping the mirrors, that was reflecting the light, and then the telescope was hanging below, and then all that was in a single kind of optical bench system that was supported outside the chamber on these vibration isolators, and the nice thing is that sitting down below that, so the mass is well below the vibration isolation, and one of the nice things, still about Houston is we didn't have zero issues with vibration.   [00:34:20] We definitely had some issues with vibration, but because we're not on bedrock, we sit on like [chuckling] you know, mud and gumbo.  Yeah, you know, we can park a tractor trailer on the backside of the building and take LM2, and we don't tend to see any of those vibrations carrying through to the chamber, so--    [00:34:39] >> Oh!    [00:34:40] >> So that was a, you know, a big, kind of deciding factor versus a facility that is built on bedrock, and you can feel things from all over and miles and miles away, and it's really hard to get a quiet environment.  We kind of-- there's not a lot of benefits, I think, like I said yeah, swamp, but it worked really good in terms of creating a real quiet atmosphere for testing.    [00:35:02] >> Yeah, so that was one of the selling points, then for bringing it to Johnson was, you know the fact that it's not sitting on Bedrock, the fact that it can provide a quieter and less vibrating kind of environment.    [00:35:13] >> Yeah, absolutely, I think that you know, the quiet environment, the size of the chamber was this Goldilocks in terms of the focal points, focal length of the primary mirror system, so we were able to design reflective mirrors at the top of the chamber, and have what we call the center of curvature optical assembly, which was the main piece of test hardware in the chamber, that did the mapping using interferometry of the primary mirrors, and make sure that, yeah, like I said, these 18 segments that are-- we started them all in like a launch lock position, they have to release, and they have to kind of move and act as a monolithic mirror, so you got-- that was a big thing we had to test is, hey, will this thing go to its right shape and make sure that it looks like a monolithic mirror, and not a bunch of individual mirrors or ones out of phase, or something like that.  Yeah, because then you won't get a clear image, right?    [00:36:06] >> Yeah, clear image, or you're losing some of the capacity of like some of the mirrors are not, you know, reacting correctly, so--    [00:36:13] >> So a lot of new technology was developed on those algorithms, and the software to position and tell the mirror like how to behave, so it was, it was very successful.  Like I said, it was very successful, but really extremely complex, probably one of the most complex thermal vacuum tests that have ever been carried out.    [00:36:33] >> Yeah, like you said, years in the making, you started conversations in 2004, and by 2009, you were already getting this thing ready to go for James Webb, right?    [00:36:41] >> Yeah, we were, yeah tons of metal was cut and thrown away and new [laughter] equipment was coming in so...    [00:36:47] >> Yeah, and not just the thermal vacuum chamber, right?  You were also doing the area outside to be a clean room too.    [00:36:56] >> Correct, so that kind of started right after we finished the chamber in 12, kind of the clean room picked up in early 13, and well, that happened pretty fast.  I think by sometime in the middle of 14 that was done.  And like I said, really has been an exceptional clean room, we were given a certain, you know, budget for how dirty the mirrors could get while they're sitting here, you know the longer something sits around, it's going to just collect, and you know, you're given this budget, and we actually stayed well under that budget.  Of course we were able to use this last, probably week and a half to do a final cleaning of the mirrors prior to it being shipped to Northrup Grumman, so it's leaving Johnson cleaner than when it arrived, so that's pretty amazing.    [00:37:39] >> That's awesome.    [00:37:40] >> Yeah.    [00:37:40] >> I'm sure, well, so I'm trying to imagine the environment that you guys are in, so you're testing it, you're in this clean room, everything is like super spotless, probably one of the cleanest places in the known universe [laughter], I don't know but it's super clean.  You guys are kind of outfitted with these white garments, right, that are head to toe, make sure no dust or hair or anything is getting on these mirrors.    [00:38:02] >> Yeah and usually, you know, human, you know dust, is typically like, you know, some type of human fallout type of thing, so you know, hair, skin cells, and other things like that, are probably the major sources of dust, so yeah, reducing that and monitoring that is a big deal, and of course everything on the spacecraft is real ESD, so everybody is outfitted with, you know, electrostatic type of wristbands when they're working on anything around there.  You know, so yeah, it's a full head to toe garment that are [laughter] quite a bit, you know, it takes a good amount of time to get suited up when you go in there.    [00:38:45] >> Yeah, I can imagine!  Especially because of the requirements, that it has to be, you know, what's the level of, like you said, the level of clean that is acceptable.  So and I'm sure that cleaning the mirrors is a whole process in and of itself, right?  You're not just going to be spraying it with Windex and kind of wiping it down, right?    [00:38:58] >> Not that was, you know, the contamination team led out of Goddard, you know, managed that effort, and it was very arduous task, that they mapped each of the mirrors, and you're mapping probably like a few inches at a time, so--    [00:39:14] >> Oh wow!    [00:39:14] >> Yeah, they're cleaning a very small area, black light it, high resolution light it, and look for any type of, you know smudge or any dust particles, and they carefully, like, anytime you could, you know, get a dust particle, try to remove it and with a small brush or something like that, but it was really, I was surprised at how detailed they were and how they handled it, but we're done now, and like I said, all the mirrors are actually quite a bit cleaner now than when it first got here, so.    [00:39:46] >> All right.  So you said now it's kind of wrapped up and ready to ship off to the next place, right?  Or are you still in the process of wrapping it up?    [00:39:53] >> No, no, we completed all the-- so you know, we had the big family day [laughter], that was a huge success and--    [00:39:58] >> Yeah.    [00:39:59] >> The 20th, then we repeat it on the second.  But on the third we really started doing the stowing, you know, the opposite of deployment.  So we stowed the mirror wings.  Stowed the deployable tower, and really got it ready for shipment soon after that, so when once all those stowing sequences were done, we began the cleaning process so really there is not a lot left to do except for take it off its turnover fixture and get it into a shipping container, and that is planned for tomorrow.    [00:40:36] >> Wow, this is exciting!  All this kind of [laughter] preparation you know, you said, talking so early, then kind of preparing the chamber, you did it, you tested it, you did it, you know, like you said under budget, and it was successful so, I mean, actually that is a good question, how did the tests go?    [00:40:52] >> Oh, the tests went really well [laughter], so the thermal vacuum test, the main part test, we call it, the Otis Cryovac Test.  Started in early July and we were under vacuum for about a little over 100 days, so yeah, we had people round the clock.  Even before then, but you know, the people operating our chamber from Johnson were probably on shift for about 102, 103 days.  Took about 30 days to cool the spacecraft down to its flight like-- took 30 days for the chamber to get down to temperature, it could have gotten much faster, but this provided the profile they needed.    [00:41:36] >> Okay.    [00:41:36] >> It took about 40 some days for the telescope to really start getting down to its flight like temperatures and start doing, start firing up the science instruments, which were really sensitive to heat, and stuff like that.    [00:41:49] >> Yes.    [00:41:50] >> Of course once we were down and just get cold, you know, Harvey shows up and--    [00:41:57] >> Oh!  That beast!    [00:41:58] >> Yeah, so, but it was-- we had a lot of plans in place, and we executed those plans, and got a lot of support from the center to keep things going and a lot of support from Goddard.  Everybody kind of pulled together, unfortunately.  Some people didn't get to go home for many, many days--    [00:42:15] >> Oh no!    [00:42:16] >> Because they couldn't find a path to their home or--    [00:42:20] >> That's right, a lot of the gates were--    [00:42:22] >> Yeah, relief could not leave their homes and get to work, so, but we had a lot of preparations for people to be able to do that, and from the Goddard perspective, you know, their team was here, locally and in hotels, and they were able to get some of the best optical testing done during that time, so--    [00:42:39] >> Wow!    [00:42:40] >> Yeah, yeah, so all the optical tests were done, I think they exceeded their requirements on all their stuff as well, so they really feel like the performance of the telescope is great.  They're delivering a product now that they really believe is going to do its mission.    [00:42:56] >> Fantastic, yeah, you have been kind of through the wringer since it's been here, huh?  You had Harvey and just like last week we had that ice storm, so yeah, you've really encountered a couple challenges, but you did it.  That's-- that's quite an accomplishment.  That's really cool.    [00:43:09] >> Thank you.  Yeah, it's been a huge-- the team here at Johnson has been very dedicated to the success of the mission and the team that has been down here, the international team, we've had hundreds of people from ESA and stuff supporting this, and everyone is extremely dedicated and really believes in what they're doing, so.    [00:43:29] >> All right.  That is so awesome, so I kind of wanted to clarify one point is, you know, I think we kind of just sort of skipped over it, but Chamber A is unique in the fact that, or maybe not unique and you can clarify this, it's a thermal vacuum chamber.    [00:43:44] >> Correct.    [00:43:44] >> So not only does it bring it down to, you know, the pressure of space, but it's also bringing it down like you said 15 Kelvin, but I guess you're testing it at 20 Kelvin.    [00:43:52] >> Yeah.    [00:43:53] >> Super cold.  I don't think people understand how cold that is, 20 Kelvin.    [00:43:58] >> Yeah so 20 Kelvin is about -423 Fahrenheit, I mean, it's cold enough that the only molecules that are moving are probably some hydrogen and helium and maybe some neon, and there is not much of that, because we have some pumps that work really well to try to get rid of that, those molecules, so there's not a lot of-- we just tell people like, when we're at room-- sea level pressure, there is about 30,000 pounds of air in that chamber, so you know, you think air doesn't have that much mass, when we're down at test temperatures, there is the mass of about a half staple in the chamber [laughter], that's what the mass of all that air is remining, so to create that space-like environment.  And then like I said temperature wise, like I said all the nitrogen, oxygen are normal air you breathe, instantly freezes out when it comes in contact with the surface that cold.    [00:44:57] >> Whoa!    [00:44:57] >> So it's just really cold [laughter], it's hard to imagine, you know, yeah, there's not much moving around at those temperatures.    [00:45:06] >> Yeah, it's just kind of when you say it the way that you say it, it's kind of surprising to think that anything works in that kind of environment, but if you think about it, there is, you know, satellites and probes all over the solar system that we've been sending, and now we are just, this is just, this is another one that is a little bit, you know it's big, and it's got a lot of-- it's got a lot of elements to it, but the fact that it is, you know, you can fire up the instruments and they worked, right?    [00:45:29] >> Oh yeah.    [00:45:30] >> The instruments--    [00:45:32] >> Yeah, all the instruments worked.    [00:45:34] >> Yeah.    [00:45:35] >> You know, so a lot of the instruments had been tested, the package was tested at Goddard, like I said, but you know, never tested as a system where, and same with the primary optics, they'd never been fully assembled and tested as a system so it was really a big deal to be able to test the primary mirror, make sure the primary mirror is acting correctly, then the secondary mirror, then actually send light all the way to the science instruments, and you know, oh yeah, you had a simulated star, and it is tracking it correctly, and it is what you simulate and are sending is what is being received, and so now you know all the elements are where they're supposed to be, and in focus, and you know, because you're talking a little, you know, probably...the thickness of a hair was way out of focus for a mirror like this, you know, so everything has got to be really tight alignment, so.    [00:46:26] >> Yeah, yeah.  Like literally 99% on this test is an F, so yeah [laughter].    [00:46:32] >> Yeah, that's a good way of putting it.    [00:46:33] >> Yeah, so that's kind of cool, you simulated it looking at a star, as like you kind of, all right, put it through this pretend environment.  Not only are you testing if it can survive the pressure and the cold, but also let's fire everything up and see if this thing can actually see stars.    [00:46:50] >> Correct, yeah, yeah.  You know, like I said, the first thing we had to do is of course make sure the primary mirrors look like a monolith.    [00:46:58] >> Yes.    [00:46:58] >> And then once those things we know, yeah, okay that looks right now, the primary mirrors and secondary mirror, are they aligned together, and then the tertiary mirror, then the science instruments, you know, and the thing has got a small amount of movement to be able to correct, you know, that type of stuff, because everything is moving a little bit, and with the temperature, so that's a big difference between this and Hubble.  This, all the mirrors have some degrees of freedom to be able to slightly move, so they've got actuators on them, allowing you to adjust their focus, or adjust their position slightly.  And so that was part of the testing was being able to make sure that all that does, works, and then some of the more challenging testing is what we, you know, would be like a pass and a half where we actually had like a fiberoptic that would simulate like a star, a point of light, and you would bounce that off the primary mirror or off the secondary mirror, back off the primary mirror, off our test mirrors, at the top of the chamber called auto-collimating flats, and then back through that entire path, then to a science instrument [laughter], so everything had to pass at least the primary optics twice, and some of the, you know, off the science instruments you know, once, and like I said any slight vibration or anything like that disturbs the image, and so you know, you had that-- everything worked really well, like I said, you don't realize hoe a little bit of shaking or something like that can really blur a point of light when you're trying to look at a few photons and stuff like that, that the telescope is supposed to be observing, so.    [00:48:31] >> Yeah, that's right, and you got an A on that test right [laughter].    [00:48:34] >> Yeah, I mean, everything-- I'm not an optical guy, but it was kind of fun to come in every day, we had typically every afternoon we had meetings, and we could hear the optical guys, like that's the first time we ever tested this?  Yeah!  And you're like almost every day was like a party during the test because [laughter] it was the first time they had done system level tests and completed an objective that, you know, they're very excited, like the performance.    [00:49:00] >> All right, I should have been hanging out with you guys every day as a party, that's pretty cool [laughter].  Cool.  But yeah, just to see the things, like you said, that you've been working on for so long, to come together, and you fire them up and they work, I can see that being like oh my gosh, yes!  Yes!  This is doing what I wanted it to do!    [00:49:15] >> Yeah!  And that was like, so on the from the Johnson Space Center standpoint, it's kind of almost a little bit benign, because we had already wrung out our chamber and created-- got rid of a lot of issues we had there, so you know, we were able to create this environment, like when we had the hurricane came, and all the rains and floods, we had some issues with the building, but the telescope never knew anything was going on [laughter] because all the facility systems operated as we wanted them to, and we really never lost anything, so you know, it wasn't the same excitement for us as it was for the telescope, because we had ben doing a series of testing, and got rid of all our bugs, so it's almost like one of those things, like boring testing from creating the environment, and doing all that is a good thing because we don't want to be testing any of our stuff out, or having any issues with our stuff, when we're really trying to test the telescope at this point, so it was great to ring all that out, and see their excitement, as they were able to test the telescope and really get to an understanding to really prove that optically it is working as they expected, and all the little requirements that pass down from some type of science objective, were met.   [00:50:23] So--    [00:50:23] >> Yes, and that means that you did your job, right?  You provided the environment for these guys.  So.    [00:50:29] >> Yeah, the team here at Johnson did.    [00:50:31] >> Yes, you and your team.  Absolutely.  Fantastic.  Very exciting!  So you're wrapping up testing, it's all wrapped up and ready to go off to its next point, so what are the next steps until it is launched?  It's going to Northrup Grumman next?    [00:50:44] >> Yeah, it goes to Northrup Grumman, and at Northrup Grumman it would be integrated with the sunshield and the spacecraft bus.  Once it's integrated, I think it there goes through a series of vibe and acoustic tests, then they have to do a deployment test, one more time, they really want to make sure that after they simulate a launch, you can do the deployments.  The sad thing about it is that it probably takes about two months to re-stow everything, you know, it's really, you know, a lot of inspections along the way to make sure that everything is folded back correctly.    [00:51:20] >> Yes.    [00:51:20] >> And all the actuators are reset correctly and then it should be ready to ship out to the launch pad from there.    [00:51:29] >> All right, so one more stop and then it goes off to launch.  And when are we ending for again?    [00:51:33] >> We are no earlier than March of 19, which would probably be more like summer time I'm thinking and 19 is probably where it's landing.    [00:51:42] >> Okay, all right.  Very exciting!  Yes!    [00:51:44] >> It is, it is.    [00:51:45] >> Then it's going to go out to L2, and we're going to see the beginnings of the universe, and all those, that awesome resume of cool things [laughter] exoplanets, the formations of galaxies, and you said stars too right?    [00:51:56] >> Yeah, I'm expecting to see, like same things you saw from Hubble.    [00:52:00] >> Yeah.    [00:52:00] >> You're going to start seeing coming from James Webb, and lots of physicists are going to hopefully just see stuff that they didn't even expect to see [laughter] and try to explain it to us, so I'm really excited about what it's going to do, and--    [00:52:14] >> Fantastic.  Well, Jonathan thank you so much for coming on, I know this is kind of at the end of your testing cycle, and you just have a couple more days until you can say yes!  Done!  [Laughter] And hands off!  So I really appreciate you coming in while it's still here, and you are kind of, I can see the excitement where you're like yes!  We did it!  I mean, there's still steps to go, but congratulations to you and your team for the successful testing here, and I just can't wait to see this thing launch, and see the beautiful images come back.    [00:52:42] >> Thank you, I'm excited as well.    [00:52:44] >> Awesome.    [00:52:45] [ Music and Inaudible Speaking ]    [00:53:09] >> Hey!  Thanks for sticking around.  So today we talked about the James Webb space telescope that was here just about two weeks ago at this point, and we just wrapped up testing here in Houston, but it's off to Northrup Grumman, and there's a lot of testing ahead, but eventually it will be launching into space, and sending some beautiful images back to earth.  So if you want to see some of the cool testing going on with Webb throughout its journey until its launch next year, you can go to NASA.gov/web.  That's a great resource for all the testing and all of the latest checkmarks and milestones that we're crossing as we get toward that launch point.  You can also go to wwww.jwst.nasa.gov, that is Goddard Space Flight Center, but like Jonathan said, that is where the project was managed out of, so there is pretty cool stuff in there, and it's actually a pretty interactive site.  It's pretty cool.  On social media, we are pretty active, too, in the James Webb space telescope as well, on Facebook, it's NASA's James Webb Space Telescope, or at web telescope.  On Twitter, it's at NASA web, and on Instagram, it's also at NASA web.   [00:54:14] You can find out some of the latest updates there as well, otherwise you can go to the NASA Johnson Space Center sites on any one of those platforms.  We see these all the time, guys, you should be following us by now.  I know you are, because you love us, and we love you.  So here's the hashtag ask NASA on the Johnson Space Center accounts, to submit question or idea for the podcast, and we will make sure to mention it in one of the later episodes.  Just make sure to mention it's for Houston We Have a Podcast.  So this podcast was recorded on January 25, 2018.  Thanks to Alex Perryman, Kelly Humphries, and Jenny Knotts.  Thanks again to Mr. Jonathan Homan for coming on the show.  We'll be back next week."
                    }
                ]
            }
        ],
        "metadata": {
            "total_hits": 2
        }
    }
}